Linbit-drbdtest/logs/test-retrieve-log/log/latency-latest/fio-drbd-sp2-autotest-1-0-bench+rw-connected-prot-A-delayed.log
## command: ['fio', '--rwmixread=50', '--runtime=15', '--section', 'bench', '-']
\Ndrbd-sp2-autotest-1: bench: (g=0): rw=randrw, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=16
drbd-sp2-autotest-1: fio-2.13
drbd-sp2-autotest-1: Starting 1 process
drbd-sp2-autotest-1: 

drbd-sp2-autotest-1: bench: (groupid=0, jobs=1): err= 0: pid=7088: Wed Aug 31 11:37:58 2016
drbd-sp2-autotest-1:   read : io=434644KB, bw=28922KB/s, iops=7230, runt= 15028msec
drbd-sp2-autotest-1:     slat (usec): min=1, max=1077, avg= 8.47, stdev=17.82
drbd-sp2-autotest-1:     clat (usec): min=29, max=74974, avg=383.74, stdev=2115.90
drbd-sp2-autotest-1:      lat (usec): min=38, max=74978, avg=392.61, stdev=2116.46
drbd-sp2-autotest-1:     clat percentiles (usec):
drbd-sp2-autotest-1:      |  1.00th=[   76],  5.00th=[  103], 10.00th=[  129], 20.00th=[  167],
drbd-sp2-autotest-1:      | 30.00th=[  189], 40.00th=[  213], 50.00th=[  245], 60.00th=[  282],
drbd-sp2-autotest-1:      | 70.00th=[  334], 80.00th=[  414], 90.00th=[  572], 95.00th=[  780],
drbd-sp2-autotest-1:      | 99.00th=[ 1448], 99.50th=[ 1768], 99.90th=[24448], 99.95th=[69120],
drbd-sp2-autotest-1:      | 99.99th=[74240]
drbd-sp2-autotest-1:     bw (KB  /s): min=24529, max=42096, per=100.00%, avg=28994.83, stdev=3649.18
drbd-sp2-autotest-1:   write: io=395712KB, bw=26332KB/s, iops=6582, runt= 15028msec
drbd-sp2-autotest-1:     slat (usec): min=2, max=1272, avg=24.25, stdev=41.95
drbd-sp2-autotest-1:     clat (usec): min=1, max=86252, avg=1924.39, stdev=10037.53
drbd-sp2-autotest-1:      lat (usec): min=45, max=86257, avg=1949.22, stdev=10035.37
drbd-sp2-autotest-1:     clat percentiles (usec):
drbd-sp2-autotest-1:      |  1.00th=[   86],  5.00th=[  137], 10.00th=[  179], 20.00th=[  209],
drbd-sp2-autotest-1:      | 30.00th=[  237], 40.00th=[  274], 50.00th=[  310], 60.00th=[  358],
drbd-sp2-autotest-1:      | 70.00th=[  422], 80.00th=[  524], 90.00th=[  732], 95.00th=[ 1096],
drbd-sp2-autotest-1:      | 99.00th=[72192], 99.50th=[75264], 99.90th=[78336], 99.95th=[81408],
drbd-sp2-autotest-1:      | 99.99th=[86528]
drbd-sp2-autotest-1:     bw (KB  /s): min=22276, max=38232, per=100.00%, avg=26393.37, stdev=3305.25
drbd-sp2-autotest-1:     lat (usec) : 2=0.01%, 4=0.05%, 10=0.02%, 20=0.01%, 50=0.09%
drbd-sp2-autotest-1:     lat (usec) : 100=3.18%, 250=39.49%, 500=39.72%, 750=10.02%, 1000=3.27%
drbd-sp2-autotest-1:     lat (msec) : 2=2.66%, 4=0.25%, 10=0.01%, 20=0.01%, 50=0.28%
drbd-sp2-autotest-1:     lat (msec) : 100=0.95%
drbd-sp2-autotest-1:   cpu          : usr=3.52%, sys=11.50%, ctx=35718, majf=0, minf=11
drbd-sp2-autotest-1:   IO depths    : 1=0.4%, 2=0.8%, 4=1.6%, 8=3.1%, 16=94.1%, 32=0.0%, >=64=0.0%
drbd-sp2-autotest-1:      submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
drbd-sp2-autotest-1:      complete  : 0=0.0%, 4=99.6%, 8=0.0%, 16=0.4%, 32=0.0%, 64=0.0%, >=64=0.0%
drbd-sp2-autotest-1:      issued    : total=r=108661/w=98928/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
drbd-sp2-autotest-1:      latency   : target=0, window=0, percentile=100.00%, depth=16
drbd-sp2-autotest-1: 

drbd-sp2-autotest-1: Run status group 0 (all jobs):
drbd-sp2-autotest-1:    READ: io=434644KB, aggrb=28922KB/s, minb=28922KB/s, maxb=28922KB/s, mint=15028msec, maxt=15028msec
drbd-sp2-autotest-1:   WRITE: io=395712KB, aggrb=26331KB/s, minb=26331KB/s, maxb=26331KB/s, mint=15028msec, maxt=15028msec
drbd-sp2-autotest-1: 

drbd-sp2-autotest-1: Disk stats (read/write):
drbd-sp2-autotest-1:     drbd138: ios=107946/98282, merge=0/0, ticks=10684/158276, in_queue=169344, util=91.33%, aggrios=108661/98928, aggrmerge=0/0, aggrticks=10668/9452, aggrin_queue=20148, aggrutil=24.80%
drbd-sp2-autotest-1:     dm-0: ios=108661/98928, merge=0/0, ticks=10668/9452, in_queue=20148, util=24.80%, aggrios=108661/98928, aggrmerge=0/0, aggrticks=10592/9356, aggrin_queue=19932, aggrutil=24.46%
drbd-sp2-autotest-1:   vdb: ios=108661/98928, merge=0/0, ticks=10592/9356, in_queue=19932, util=24.46%